---
kind: method
id: M:Autodesk.Revit.DB.ReferenceArrayArray.#ctor
source: html/7fcd4533-c3bd-98df-a681-7411bb8a0ffa.htm
---
# Autodesk.Revit.DB.ReferenceArrayArray.#ctor Method

Initializes a new instance of the ReferenceArrayArray class

## Syntax (C#)
```csharp
public ReferenceArrayArray()
```